
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Автоматическое заполнение реквизита Акция.
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Акции.Ссылка
		|ИЗ
		|	Справочник.Акции КАК Акции
		|ГДЕ
		|	Акции.ДатаНачала <= &ДатаДокумента
		|
		|УПОРЯДОЧИТЬ ПО
		|	Акции.ДатаНачала УБЫВ";
	
	Запрос.УстановитьПараметр("ДатаДокумента", Объект.Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Объект.Акция = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЕсли;
	
КонецПроцедуры
