//начало текста модуля

///////////////////////////////////////////////////
//Служебные функции и процедуры
///////////////////////////////////////////////////

&НаКлиенте
// контекст фреймворка Vanessa-Behavior
Перем Ванесса;
 
&НаКлиенте
// Структура, в которой хранится состояние сценария между выполнением шагов. Очищается перед выполнением каждого сценария.
Перем Контекст Экспорт;
 
&НаКлиенте
// Структура, в которой можно хранить служебные данные между запусками сценариев. Существует, пока открыта форма Vanessa-Behavior.
Перем КонтекстСохраняемый Экспорт;

&НаКлиенте
// Функция экспортирует список шагов, которые реализованы в данной внешней обработке.
Функция ПолучитьСписокТестов(КонтекстФреймворкаBDD) Экспорт
	Ванесса = КонтекстФреймворкаBDD;
	
	ВсеТесты = Новый Массив;

	//описание параметров
	//Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,Снипет,ИмяПроцедуры,ПредставлениеТеста,Транзакция,Параметр);

	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"НачальныйОстатокЯблок(Парам01)","НачальныйОстатокЯблок","Дано Начальный остаток яблок = 0");

	Возврат ВсеТесты;
КонецФункции
	
&НаСервере
// Служебная функция.
Функция ПолучитьМакетСервер(ИмяМакета)
	ОбъектСервер = РеквизитФормыВЗначение("Объект");
	Возврат ОбъектСервер.ПолучитьМакет(ИмяМакета);
КонецФункции
	
&НаКлиенте
// Служебная функция для подключения библиотеки создания fixtures.
Функция ПолучитьМакетОбработки(ИмяМакета) Экспорт
	Возврат ПолучитьМакетСервер(ИмяМакета);
КонецФункции



///////////////////////////////////////////////////
//Работа со сценариями
///////////////////////////////////////////////////

&НаКлиенте
// Процедура выполняется перед началом каждого сценария
Процедура ПередНачаломСценария() Экспорт
	
КонецПроцедуры

&НаКлиенте
// Процедура выполняется перед окончанием каждого сценария
Процедура ПередОкончаниемСценария() Экспорт
	
КонецПроцедуры



///////////////////////////////////////////////////
//Реализация шагов
///////////////////////////////////////////////////


&НаКлиенте
//Дано Начальный остаток яблок = 0
//@НачальныйОстатокЯблок(НачальныыйОстаток)
Процедура НачальныйОстатокЯблок(НачальныыйОстаток) Экспорт
	//Ванесса.ПосмотретьЗначение(НачальныыйОстаток,Истина);
	
	ОбнулитьОстатки(НачальныыйОстаток);	
	
КонецПроцедуры

// Серверные процедуры и функции
&НаСервере
Процедура ОбнулитьОстатки(НачальныйОстаток) 
	
	СписокДокументов = Документы.Покупка.Выбрать();
	Пока СписокДокументов.Следующий() Цикл
		ДокОбъект = СписокДокументов.Ссылка.ПолучитьОбъект();
		ДокОбъект.Удалить();
	КонецЦикла;
	
	СписокДокументов = Документы.Продажа.Выбрать();
	Пока СписокДокументов.Следующий() Цикл
		ДокОбъект = СписокДокументов.Ссылка.ПолучитьОбъект();
		ДокОбъект.Удалить();
	КонецЦикла;
	
	Если НачальныйОстаток > 0 Тогда
		ДокПоступления = Документы.Покупка.СоздатьДокумент();
		ДокПоступления.Дата = ТекущаяДата();
		СтрокаТЧ = ДокПоступления.Товары.Добавить();
		СтрокаТЧ.Номенклатура = Справочники.Номенклатура.НайтиПоНаименованию("Яблоко");
		СтрокаТЧ.Количество = НачальныйОстаток;
		ДокПоступления.Записать(РежимЗаписиДокумента.Проведение);
	КонецЕсли;	
	
КонецПроцедуры
